<a href="https://colab.research.google.com/github/sdazz56/Data-Science-Projects/blob/main/Multi_variate_regression.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [18]:
import numpy as np
import pandas as pd

In [19]:
df=pd.read_csv('/content/Levels_Fyi_Salary_Data.csv')
df.head()

            timestamp    company level  ... Race_Hispanic  Race Education
0   6/7/2017 11:33:27     Oracle    L3  ...             0   NaN       NaN
1  6/10/2017 17:11:29       eBay  SE 2  ...             0   NaN       NaN
2  6/11/2017 14:53:57     Amazon    L7  ...             0   NaN       NaN
3   6/17/2017 0:23:14      Apple    M1  ...             0   NaN       NaN
4  6/20/2017 10:58:51  Microsoft    60  ...             0   NaN       NaN

[5 rows x 29 columns]

In [20]:
salary_table=df[['company','totalyearlycompensation','yearsofexperience','yearsatcompany','basesalary']]
salary_table.head()

     company  totalyearlycompensation  ...  yearsatcompany  basesalary
0     Oracle                   127000  ...             1.5    107000.0
1       eBay                   100000  ...             3.0         0.0
2     Amazon                   310000  ...             0.0    155000.0
3      Apple                   372000  ...             5.0    157000.0
4  Microsoft                   157000  ...             3.0         0.0

[5 rows x 5 columns]

# Create training and testing data

y=totalyearlycompensation

x1 = yearsofexperience

x2 = yearsatcompany

x3 = basesalary

y=x1w1+x2w2+x3w3

x.transpose= (x1 x2 x3 1)

w.transpose = (w1 w2 w3 b )

In [ ]:
x_train=salary_table.iloc[:50000,2:]
y_train=salary_table.iloc[:50000,1]
x_test=salary_table.iloc[50000:,2:]
y_test=salary_table.iloc[50000:,1]
x_train.assign(b=1)
x_test.assign(b=1)

In [22]:
def root_mean_square_error(targets,predictions):
  np.sqrt((np.square(targets-predictions)).mean())

def calculateWeights(x_train,y_train):
  w=np.linalg.inv(np.transpose(x_train).dot(x_train)).dot(np.transpose(x_train).dot(y_train))
  return w

In [ ]:
w=calculateWeights(x_train,y_train)
print(x_train.shape)

In [24]:
y_train_pred=x_train.dot(w)
train_error=root_mean_square_error(y_train,y_train_pred)
print(train_error)

y_test_pred=x_test.dot(w)
test_error=root_mean_square_error(y_test,y_test_pred)
print(test_error)

None
None